<?php


/* ======================================
  テーマの設定(セキュリティなど最初に設定する関数)
======================================*/
require_once(dirname(__FILE__).'/admin/theme_setup.php');

/* ======================================
  headタグ内の設定(カスタムフィールドなど)
======================================*/
require_once(dirname(__FILE__).'/admin/head_setup.php');

/* ======================================
  ウィジェットの設定
======================================*/
require_once(dirname(__FILE__).'/admin/widgets_setup.php');

/* ======================================
  カスタム投稿タイプの設定
======================================*/
require_once(dirname(__FILE__).'/admin/customPost_setup.php');

/* ======================================
  便利な関数をまとめる
======================================*/
require_once(dirname(__FILE__).'/admin/toolkit.php');
